In [5]:
import pandas as pd
import numpy as np

In [6]:
dict1={
    'Name':['Idris','Awais','Zakir','Usama'],
    'Marks':[87,78,76,79],
    'CIty':['Nowshera','Mardan','Manshera','Kamra']
}

In [7]:
#this command is used to make Frames into raw data
data=pd.DataFrame(dict1)

In [8]:
data

    Name  Marks      CIty
0  Idris     87  Nowshera
1  Awais     78    Mardan
2  Zakir     76  Manshera
3  Usama     79     Kamra

In [9]:
#this command is used to store data into excel file
data.to_csv('friends.csv')

In [10]:
#this command is used to store data without indexes
data.to_csv('friends without index.csv',index=False)

In [11]:
data.head(2)

    Name  Marks      CIty
0  Idris     87  Nowshera
1  Awais     78    Mardan

In [12]:
data.tail(2)

    Name  Marks      CIty
2  Zakir     76  Manshera
3  Usama     79     Kamra

In [13]:
data.describe()

           Marks
count   4.000000
mean   80.000000
std     4.830459
min    76.000000
25%    77.500000
50%    78.500000
75%    81.000000
max    87.000000

In [20]:
idris=pd.read_csv('friends.1.csv')

In [21]:
idris

     train  speed      CIty
0  1233412     87  Nowshera
1  3344142     78    Mardan
2  3242355     76  Manshera
3  3252352     79     Kamra

In [22]:
idris['speed']

0    87
1    78
2    76
3    79
Name: speed, dtype: int64

In [23]:
idris['speed'][0]

87

In [24]:
idris['speed'][0]=100

C:\Users\Idris Khan\AppData\Local\Temp\ipykernel_8260\4029544834.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  idris['speed'][0]=100

In [25]:
idris

     train  speed      CIty
0  1233412    100  Nowshera
1  3344142     78    Mardan
2  3242355     76  Manshera
3  3252352     79     Kamra

In [26]:
idris.to_csv('friends.1.csv')